In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline 
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20, 10)

In [3]:
df = pd.read_csv("bengaluru_house_prices.csv")

In [4]:
df.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [6]:
df.shape

(13320, 9)

In [11]:
df.groupby("area_type")["area_type"].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [27]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [28]:
df1 = df.drop(columns=["availability","society","balcony","area_type"])

In [29]:
df1.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [30]:
df1.isna().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [31]:
df2 = df1.dropna()

In [32]:
df2.isna().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [33]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [35]:
df2.loc[:, "Size(in BHK)"] = df2["size"].apply(lambda x: int(x.split(' ')[0]))

In [36]:
df2.head()

                   location       size total_sqft  bath   price  Size(in BHK)
0  Electronic City Phase II      2 BHK       1056   2.0   39.07             2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00             4
2               Uttarahalli      3 BHK       1440   2.0   62.00             3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00             3
4                  Kothanur      2 BHK       1200   2.0   51.00             2

In [41]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [45]:
def isFloat(x):
    try:
        float(x)
        return True 
    except:
        return False  


df2[df2['total_sqft'].apply(isFloat)]

,location,size,total_sqft,bath,price,Size(in BHK)
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4
2,Uttarahalli,3 BHK,1440,2.0,62.00,3
3,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3
4,Kothanur,2 BHK,1200,2.0,51.00,2
...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,3453,4.0,231.00,5
13316,Richards Town,4 BHK,3600,5.0,400.00,4
13317,Raja Rajeshwari Nagar,2 BHK,1141,2.0,60.00,2
13318,Padmanabhanagar,4 BHK,4689,4.0,488.00,4
13319,Doddathoguru,1 BHK,550,1.0,17.00,1

In [103]:
def convert_sqft_to_num(x):
    token = x.split('-')
    if len(token) ==2:
        return (float(token[0])+float(token[1])/2)

    try:
        return float(x)
    except:
        return None

In [104]:
df4= df2.copy()

In [105]:
df4["total_sqft"]=df4["total_sqft"].apply(convert_sqft_to_num)

In [106]:
df4.head()

                   location       size  total_sqft  bath   price  Size(in BHK)
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07             2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00             4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00             3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00             3
4                  Kothanur      2 BHK      1200.0   2.0   51.00             2

In [107]:
df4["total_sqft"].unique()

array([1056., 2600., 1440., ..., 2758.,  774., 4689.])

In [119]:
df5=df4.copy()

In [120]:
df5['price_per_sqft'] = (df.price * 100000) /df5["total_sqft"]

In [121]:
df5.head()

,location,size,total_sqft,bath,price,Size(in BHK),price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [123]:
len(df5.location.unique())

1304

In [124]:
df5.location = df5.location.apply(lambda x:x.strip())

In [129]:
loc_state=df5.groupby("location")["location"].agg("count").sort_values(ascending=False)

In [132]:
len(loc_state[loc_state<=10])

1052

In [133]:
location_less_than_10 = loc_state[loc_state<=10]

In [134]:
len(location_less_than_10)

1052

In [135]:
df5.location = df5.location.apply(lambda x: "others" if x in location_less_than_10 else x)

In [139]:
len(df5.location.unique())

242

In [140]:
df5.head()

,location,size,total_sqft,bath,price,Size(in BHK),price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [141]:
df5.tail()

,location,size,total_sqft,bath,price,Size(in BHK),price_per_sqft
13315,Whitefield,5 Bedroom,3453.0,4.0,231.0,5,6689.834926
13316,others,4 BHK,3600.0,5.0,400.0,4,11111.111111
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.0,2,5258.545136
13318,Padmanabhanagar,4 BHK,4689.0,4.0,488.0,4,10407.336319
13319,Doddathoguru,1 BHK,550.0,1.0,17.0,1,3090.909091